## Plan Result (nonprod_general - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 1 to change, 5 to destroy.</code></pre>

* Update
  * azurerm_postgresql_server.atlassian-server
* Replace
  * azurerm_application_gateway.ag
  * azurerm_key_vault.atlassian_kv
  * azurerm_public_ip.app_gw
  * azurerm_role_assignment.identity
  * azurerm_user_assigned_identity.identity
* Move
  * azurerm_key_vault.atlasssian_kv => azurerm_key_vault.atlassian_kv




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-PASS will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "nonprod-POSTGRES-SINGLE-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-USER will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "nonprod-POSTGRES-SINGLE-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_application_gateway.ag must be replaced
-/+ resource "azurerm_application_gateway" "ag" {
      - fips_enabled                      = false -> null
      - force_firewall_policy_association = false -> null
      ~ id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway" -> (known after apply)
      ~ name                              = "atlasssian-nonprod-app-gateway" -> "atlassian-nonprod-app-gateway" # forces replacement
      ~ private_endpoint_connection       = [] -> (known after apply)
        tags                              = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
      - zones                             = [] -> null
        # (4 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/backendAddressPools/appgw-backend-pool-cnf" -> null
          - ip_addresses = [
              - "10.0.4.200",
              - "10.0.4.201",
            ] -> null
          - name         = "appgw-backend-pool-cnf" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/backendAddressPools/appgw-backend-pool-crd" -> null
          - ip_addresses = [
              - "10.0.4.202",
            ] -> null
          - name         = "appgw-backend-pool-crd" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/backendAddressPools/appgw-backend-pool-jira" -> null
          - ip_addresses = [
              - "10.0.4.197",
              - "10.0.4.198",
              - "10.0.4.199",
            ] -> null
          - name         = "appgw-backend-pool-jira" -> null
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.0.4.197",
              + "10.0.4.198",
              + "10.0.4.199",
            ]
          + name         = "appgw-backend-pool-jira"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.0.4.200",
              + "10.0.4.201",
            ]
          + name         = "appgw-backend-pool-cnf"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.0.4.202",
            ]
          + name         = "appgw-backend-pool-crd"
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Enabled" -> null
          - id                                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/backendHttpSettingsCollection/appgw-backend-settings-crd" -> null
          - name                                = "appgw-backend-settings-crd" -> null
          - pick_host_name_from_backend_address = true -> null
          - port                                = 8095 -> null
          - probe_id                            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/probes/appgw-probe-crd" -> null
          - probe_name                          = "appgw-probe-crd" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 300 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)

          - connection_draining {
              - drain_timeout_sec = 15 -> null
              - enabled           = false -> null
            }
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Enabled" -> null
          - id                                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/backendHttpSettingsCollection/appgw-backend-settings-cnf" -> null
          - name                                = "appgw-backend-settings-cnf" -> null
          - pick_host_name_from_backend_address = true -> null
          - port                                = 8090 -> null
          - probe_id                            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/probes/appgw-probe-cnf" -> null
          - probe_name                          = "appgw-probe-cnf" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 300 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)

          - connection_draining {
              - drain_timeout_sec = 15 -> null
              - enabled           = true -> null
            }
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Enabled" -> null
          - id                                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/backendHttpSettingsCollection/appgw-backend-settings-jira" -> null
          - name                                = "appgw-backend-settings-jira" -> null
          - pick_host_name_from_backend_address = true -> null
          - port                                = 8080 -> null
          - probe_id                            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/probes/appgw-probe-jira" -> null
          - probe_name                          = "appgw-probe-jira" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 300 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)

          - connection_draining {
              - drain_timeout_sec = 15 -> null
              - enabled           = true -> null
            }
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Enabled"
          + id                                  = (known after apply)
          + name                                = "appgw-backend-settings-crd"
          + pick_host_name_from_backend_address = true
          + port                                = 8095
          + probe_id                            = (known after apply)
          + probe_name                          = "appgw-probe-crd"
          + protocol                            = "Http"
          + request_timeout                     = 300
          + trusted_root_certificate_names      = []
            # (3 unchanged attributes hidden)

          + connection_draining {
              + drain_timeout_sec = 15
              + enabled           = false
            }
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Enabled"
          + id                                  = (known after apply)
          + name                                = "appgw-backend-settings-cnf"
          + pick_host_name_from_backend_address = true
          + port                                = 8090
          + probe_id                            = (known after apply)
          + probe_name                          = "appgw-probe-cnf"
          + protocol                            = "Http"
          + request_timeout                     = 300
          + trusted_root_certificate_names      = []
            # (3 unchanged attributes hidden)

          + connection_draining {
              + drain_timeout_sec = 15
              + enabled           = true
            }
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Enabled"
          + id                                  = (known after apply)
          + name                                = "appgw-backend-settings-jira"
          + pick_host_name_from_backend_address = true
          + port                                = 8080
          + probe_id                            = (known after apply)
          + probe_name                          = "appgw-probe-jira"
          + protocol                            = "Http"
          + request_timeout                     = 300
          + trusted_root_certificate_names      = []
            # (3 unchanged attributes hidden)

          + connection_draining {
              + drain_timeout_sec = 15
              + enabled           = true
            }
        }

      ~ frontend_ip_configuration {
          ~ id                              = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/frontendIPConfigurations/appGwPublicFrontendIp" -> (known after apply)
            name                            = "appGwPublicFrontendIp"
          + private_ip_address              = (known after apply)
          + private_link_configuration_id   = (known after apply)
          ~ public_ip_address_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/publicIPAddresses/atlasssian-nonprod-public-ip" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      - frontend_port {
          - id   = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/frontendPorts/http" -> null
          - name = "http" -> null
          - port = 80 -> null
        }
      - frontend_port {
          - id   = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/frontendPorts/https" -> null
          - name = "https" -> null
          - port = 443 -> null
        }
      + frontend_port {
          + id   = (known after apply)
          + name = "http"
          + port = 80
        }
      + frontend_port {
          + id   = (known after apply)
          + name = "https"
          + port = 443
        }

      ~ gateway_ip_configuration {
          ~ id        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/gatewayIPConfigurations/gateway" -> (known after apply)
            name      = "gateway"
            # (1 unchanged attribute hidden)
        }

      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/frontendIPConfigurations/appGwPublicFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPublicFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/frontendPorts/https" -> null
          - frontend_port_name             = "https" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/httpListeners/appgw-http-listener" -> null
          - name                           = "appgw-http-listener" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = false -> null
          - ssl_certificate_id             = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/sslCertificates/staging.tools.hmcts.net" -> null
          - ssl_certificate_name           = "staging.tools.hmcts.net" -> null
            # (4 unchanged attributes hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "appgw-http-listener"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "staging.tools.hmcts.net"
          + ssl_profile_id                 = (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ identity {
          ~ identity_ids = [
              - "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/atlasssian-nonprod-app-gateway-identity",
            ] -> (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
            # (1 unchanged attribute hidden)
        }

      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/probes/appgw-probe-cnf" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-cnf" -> null
          - path                                      = "/confluence" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/probes/appgw-probe-crd" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-crd" -> null
          - path                                      = "/crowd" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/probes/appgw-probe-jira" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-jira" -> null
          - path                                      = "/jira/status" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/httpListeners/appgw-http-listener" -> null
          - http_listener_name          = "appgw-http-listener" -> null
          - id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/requestRoutingRules/appgw-routing-rule" -> null
          - name                        = "appgw-routing-rule" -> null
          - priority                    = 1 -> null
          - rule_type                   = "PathBasedRouting" -> null
          - url_path_map_id             = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/urlPathMaps/appgw-url-map-path" -> null
          - url_path_map_name           = "appgw-url-map-path" -> null
            # (8 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "appgw-backend-pool-cnf"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "appgw-backend-settings-cnf"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-http-listener"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (2 unchanged attributes hidden)
        }

      ~ sku {
          - capacity = 0 -> null
            name     = "WAF_v2"
            # (1 unchanged attribute hidden)
        }

      - ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      ~ ssl_policy (known after apply)
      - ssl_policy {
          - cipher_suites        = [] -> null
          - disabled_protocols   = [] -> null
          - policy_name          = "AppGwSslPolicy20220101" -> null
          - policy_type          = "Predefined" -> null
            # (1 unchanged attribute hidden)
        }

      ~ url_path_map {
          ~ default_backend_address_pool_id     = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/backendAddressPools/appgw-backend-pool-cnf" -> (known after apply)
          ~ default_backend_http_settings_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/backendHttpSettingsCollection/appgw-backend-settings-cnf" -> (known after apply)
          + default_redirect_configuration_id   = (known after apply)
          + default_rewrite_rule_set_id         = (known after apply)
          ~ id                                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/urlPathMaps/appgw-url-map-path" -> (known after apply)
            name                                = "appgw-url-map-path"
            # (4 unchanged attributes hidden)

          ~ path_rule {
              ~ backend_address_pool_id     = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/backendAddressPools/appgw-backend-pool-cnf" -> (known after apply)
              ~ backend_http_settings_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/backendHttpSettingsCollection/appgw-backend-settings-cnf" -> (known after apply)
              ~ id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/urlPathMaps/appgw-url-map-path/pathRules/confluence" -> (known after apply)
                name                        = "confluence"
              + redirect_configuration_id   = (known after apply)
              + rewrite_rule_set_id         = (known after apply)
                # (6 unchanged attributes hidden)
            }
          ~ path_rule {
              ~ backend_address_pool_id     = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/backendAddressPools/appgw-backend-pool-crd" -> (known after apply)
              ~ backend_http_settings_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/backendHttpSettingsCollection/appgw-backend-settings-crd" -> (known after apply)
              ~ id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/urlPathMaps/appgw-url-map-path/pathRules/crowd" -> (known after apply)
                name                        = "crowd"
              + redirect_configuration_id   = (known after apply)
              + rewrite_rule_set_id         = (known after apply)
                # (6 unchanged attributes hidden)
            }
          ~ path_rule {
              ~ backend_address_pool_id     = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/backendAddressPools/appgw-backend-pool-jira" -> (known after apply)
              ~ backend_http_settings_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/backendHttpSettingsCollection/appgw-backend-settings-jira" -> (known after apply)
              ~ id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlasssian-nonprod-app-gateway/urlPathMaps/appgw-url-map-path/pathRules/jira" -> (known after apply)
                name                        = "jira"
              + redirect_configuration_id   = (known after apply)
              + rewrite_rule_set_id         = (known after apply)
                # (6 unchanged attributes hidden)
            }
        }

      ~ waf_configuration {
          ~ firewall_mode            = "Detection" -> "Prevention"
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault.atlassian_kv must be replaced
  # (moved from azurerm_key_vault.atlasssian_kv)
-/+ resource "azurerm_key_vault" "atlassian_kv" {
      - enable_rbac_authorization       = false -> null
      - enabled_for_deployment          = false -> null
      - enabled_for_disk_encryption     = false -> null
      - enabled_for_template_deployment = false -> null
      ~ id                              = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv" -> (known after apply)
      ~ name                            = "atlasssian-nonprod-kv" -> "atlassian-nonprod-kv" # forces replacement
        tags                            = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
      ~ vault_uri                       = "https://atlasssian-nonprod-kv.vault.azure.net/" -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ contact (known after apply)

      ~ network_acls (known after apply)
      - network_acls {
          - bypass                     = "AzureServices" -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }
    }

  # azurerm_postgresql_server.atlassian-server will be updated in-place
  ~ resource "azurerm_postgresql_server" "atlassian-server" {
      ~ administrator_login_password      = (sensitive value)
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-nonprod-server"
        name                              = "atlassian-nonprod-server"
      ~ tags                              = {
          - "application"  = "atlassian" -> null
          - "builtFrom"    = "hmcts/atlassian-infrastructure" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "staging" -> null
        }
        # (15 unchanged attributes hidden)
    }

  # azurerm_public_ip.app_gw must be replaced
-/+ resource "azurerm_public_ip" "app_gw" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/publicIPAddresses/atlasssian-nonprod-public-ip" -> (known after apply)
      ~ ip_address              = "20.0.64.191" -> (known after apply)
      - ip_tags                 = {} -> null
      ~ name                    = "atlasssian-nonprod-public-ip" -> "atlassian-nonprod-public-ip" # forces replacement
        tags                    = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
      - zones                   = [] -> null
        # (9 unchanged attributes hidden)
    }

  # azurerm_role_assignment.identity must be replaced
-/+ resource "azurerm_role_assignment" "identity" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv/providers/Microsoft.Authorization/roleAssignments/2416b9b8-7445-627f-7db3-32255334ca6a" -> (known after apply)
      ~ name                                   = "2416b9b8-7445-627f-7db3-32255334ca6a" -> (known after apply)
      ~ principal_id                           = "35433a65-814f-42c5-8da3-e981eeb95f1c" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      ~ scope                                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # azurerm_user_assigned_identity.identity must be replaced
-/+ resource "azurerm_user_assigned_identity" "identity" {
      ~ client_id           = "95f9f3ef-f88b-452d-b46d-11d30ebfbeea" -> (known after apply)
      ~ id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/atlasssian-nonprod-app-gateway-identity" -> (known after apply)
      ~ name                = "atlasssian-nonprod-app-gateway-identity" -> "atlassian-nonprod-app-gateway-identity" # forces replacement
      ~ principal_id        = "35433a65-814f-42c5-8da3-e981eeb95f1c" -> (known after apply)
        tags                = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
      ~ tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 5 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":23,"Program":"tfcmt","SHA1":"","Target":"nonprod_general - TerraformPlanApply","Vars":{}} -->